app/controllers/freelancers_controller.rb

    def show
      @freelancer = Freelancer.find_by(id: 4)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def register_expertise
        @freelancer = Freelancer.find_by(id: 4)
        @job_categories = Job_category.all
        @experience_levels = Experience_level_hourly_rate.all
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "job_categories".* FROM "job_categories"
SELECT "experience_level_hourly_rates".* FROM "experience_level_hourly_rates"

    def create_expertise
        #save expertise data
        @freelancer = Freelancer.find_by(id: 4)

        if !@freelancer.nil?
            @freelancer.update(freelancer_params)
        else
            @freelancer = Freelancer.new(freelancer_params)
            @freelancer.save
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "freelancers" SET "job_category_id" = $1, "experience_level_hourly_rate_id" = $2 WHERE "freelancers"."id" = $3  [["job_category_id", 2], ["experience_level_hourly_rate_id", 23], ["id", 4]]
INSERT INTO "freelancers" DEFAULT VALUES RETURNING "id"

    def register_profile
      @freelancer = Freelancer.find_by(id: 4)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create_profile
        #save profile data
      @freelancer = Freelancer.find_by(id: 4)
      if !@freelancer.nil?
          @freelancer.update(freelancer_params)
      else
          @freelancer = Freelancer.new(freelancer_params)
          @freelancer.save
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "freelancers" SET "professional_title" = $1, "professional_overview" = $2 WHERE "freelancers"."id" = $3  [["professional_title", "dddd"], ["professional_overview", "yyyyy"], ["id", 4]]
INSERT INTO "freelancers" ("professional_title", "professional_overview") VALUES ($1, $2) RETURNING "id"  [["professional_title", "aaaa"], ["professional_overview", "bbbb"]]

    def create


      @freelancers = Job_category.new(name: params[:freelancers])
      @freelancers.save
---
INSERT INTO "job_categories" DEFAULT VALUES RETURNING "id"